joshuachan6988/STM32F429I-DISCO---Beginner-Code/DEMO/Src/main.c
  /*Configure GPIO pins : G7_Pin B2_Pin */
  GPIO_InitStruct.Pin = G7_Pin|B2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : G3_Pin B4_Pin */
  GPIO_InitStruct.Pin = G3_Pin|B4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_LTDC;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : LD3_Pin LD4_Pin */
  GPIO_InitStruct.Pin = LD3_Pin|LD4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : SDCKE1_Pin SDNE1_Pin */
  GPIO_InitStruct.Pin = SDCKE1_Pin|SDNE1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF12_FMC;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, NCS_MEMS_SPI_Pin|CSX_Pin|OTG_FS_PSO_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(ACP_RST_GPIO_Port, ACP_RST_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, RDX_Pin|WRX_DCX_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOG, LD3_Pin|LD4_Pin, GPIO_PIN_RESET);

}

/* USER CODE BEGIN 4 */

/* LED_Toggle function */
void LED4_Toggle(void)
{
	/* Toggle LED State */
	BSP_LED_Toggle(LED3);
}

/* SCREEN_Toggle function */
void SCREEN_Toggle(unsigned int state)
{
	/* Toggle the Scren */
	if(state == 0)
	{
		/* BGC Red to White */
		/* LCD background color */
		BSP_LCD_Clear(LCD_COLOR_RED);
		/* Text background color */
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		/* Text color */
		BSP_LCD_SetTextColor(LCD_COLOR_RED);
		/* LCD Title Show */
		BSP_LCD_DisplayStringAt(0, 40, "FreeRTOS", CENTER_MODE);
		/* Make the Botton to be Red */
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_DrawCircle(120, 180, 30);
		BSP_LCD_FillCircle(120, 180, 30);
	}
	else
	{
		/* BGC White to Red */
		/* LCD background color */
		BSP_LCD_Clear(LCD_COLOR_WHITE);
		/* Text background color */
		BSP_LCD_SetBackColor(LCD_COLOR_RED);
		/* Text color */
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		/* LCD Title Show */
		BSP_LCD_DisplayStringAt(0, 40, "FreeRTOS", CENTER_MODE);
		/* Make the Botton to be Red */
		BSP_LCD_SetTextColor(LCD_COLOR_RED);
		BSP_LCD_DrawCircle(120, 180, 30);
		BSP_LCD_FillCircle(120, 180, 30);
	}
}
void USART_Send(uint8_t *Message)
{
	osMutexWait(Toggle_MutexHandle, 1000);
	{
		HAL_UART_Transmit(&huart1, Message, sizeof(Message), 1000);
	}
	osMutexRelease (Toggle_MutexHandle);
	/*osMutexWait(Toggle_MutexHandle, 1000);
	{
		uint8_t buffer = '\0';
	
		while(buffer != 'G')
		{
			HAL_UART_Transmit(&huart1, Message, sizeof(Message), 1000);
			osDelay(20);
			HAL_UART_Receive(&huart1, &buffer, sizeof(buffer), 1000);
			buffer = '\0';
		}
	}
	osMutexRelease (Toggle_MutexHandle);*/
}
/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/* LED_Blink function */
void LED_Blink(void const * argument)
{
  /* USER CODE BEGIN LED_Blink */
  /* Infinite loop */
  for(;;)
  {
		BSP_LED_Toggle(LED4);
    osDelay(1000);
  }
  /* USER CODE END LED_Blink */
}

/* TOUCH_Detect function */
void TOUCH_Detect(void const * argument)
{
  /* USER CODE BEGIN TOUCH_Detect */
  static TS_StateTypeDef  TS_State;
	static uint32_t x = 0, y = 0;
	static uint32_t cx = 0, cy = 0;
	
  /* Infinite loop */
  for(;;)
  {
		/* Get touch screen position */
		BSP_TS_GetState(&TS_State);
		x = TS_State.X;
		y = TS_State.Y;
		/* Checks if touch is detected */
		if(TS_State.TouchDetected && !(cx == x && cy == y) )
		{
			cx = x;
			cy = y;
			if(y >= 160 & y <= 200)
			{
				/* Checks if 1st button is pressed */
				if(x >= 100 & x <= 140) 
				{
					/* USART_Send */
					USART_Send( (uint8_t *) "T");
					/* LED4_Toggle */
					LED4_Toggle();
					/* SCREEN_Toggle */
					SCREEN_Toggle(Toggle_count);
					/* Change Toggle_count */
					Toggle_count = (Toggle_count + 1)%2;
					/* Prevent Multiple Touch */
					osDelay(100);
				}
			}
		}
    osDelay(50);
  }
  /* USER CODE END TOUCH_Detect */
}

/* USART_Receive function */
void USART_Receive(void const * argument)
{
  /* USER CODE BEGIN USART_Receive */
	uint8_t buffer = '\0';
  /* Infinite loop */
  for(;;)
  {
		osMutexWait(Toggle_MutexHandle, 1000);
		{
			HAL_UART_Receive(&huart1, &buffer, sizeof(buffer), 1000);
		}
		osMutexRelease (Toggle_MutexHandle);
		
		if(buffer != '\0')
		{
			if(buffer == (uint8_t) 'T')
			{
				/* LED4_Toggle */
				LED4_Toggle();
				/* SCREEN_Toggle */
				SCREEN_Toggle(Toggle_count);
				/* Change Toggle_count */
				Toggle_count = (Toggle_count + 1)%2;
			}
			//USART_Send( (uint8_t *) "Y");
			buffer = '\0';
		}
    osDelay(100);
  }
  /* USER CODE END USART_Receive */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
